app/views/lists/show.html.erb

<ol>
  <% @list.ingredients.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."list_id" = ?  [["list_id", 1]]


<% @list.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."list_id" = ?  [["list_id", 10]]