app/views/welcome/home.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."list_id" = ?  [["list_id", 14]]
---
      <% @lists.each do |list| %>
        <h5><%=link_to list.name, list_path(list)%> Rating <% list.ratings.each do |rating| %>