app/controllers/comments_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("content", "user_id", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "need cherry"], ["user_id", 1], ["list_id", 10], ["created_at", "2016-04-01 18:04:07.160178"], ["updated_at", "2016-04-01 18:04:07.160178"]]
---
  def create
    #binding.pry
    @list = List.find_by(id: comment_params[:list_id])
    @comment = @list.comments.create(comment_params)