app/controllers/ingredients_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 10]]
---
  def new
    @list = List.find(params[:list_id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "ingredients" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "cheese"], ["created_at", "2016-03-31 20:07:54.027064"], ["updated_at", "2016-03-31 20:07:54.027064"]]
---
  def create
    @list = List.find(params[:list_id])
    @ingredient = @list.ingredients.create(ingredient_params)