app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    #binding.pry
    @lists = List.all

INSERT INTO "lists" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "chicken parm"], ["content", "a lot of chicken"], ["created_at", "2016-03-31 14:40:09.075660"], ["updated_at", "2016-03-31 14:40:09.075660"]]
UPDATE "lists" SET "user_id" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["user_id", 1], ["updated_at", "2016-03-31 14:40:09.158884"], ["id", 1]]
---
  def create
    @list = List.create(list_params)
    #binding.pry
    # list_params = {id:somethign, name:something, ingredients_attributes:{description:'sauce'}}
    @list.user = current_user
    @list.save

UPDATE "lists" SET "name" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["name", "las"], ["updated_at", "2016-03-31 14:47:35.135899"], ["id", 3]]
---
  def update
    find_recipe
    @list.update(list_params)

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
    find_recipe
    @list.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 3]]
---
  def find_recipe
    #binding.pry
    @list = List.find(params[:id])