app/controllers/ratings_controller.rb

  def create
    #binding.pry
    @list = List.find_by(id: rating_params[:list_id])
    @rating = @list.ratings.create(rating_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 14]]
INSERT INTO "ratings" ("star_rating", "list_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["star_rating", 4], ["list_id", 14], ["user_id", 2], ["created_at", "2016-04-01 22:47:33.834530"], ["updated_at", "2016-04-01 22:47:33.834530"]]