app/controllers/sessions_controller.rb

  def create

    if auth.nil?
      @user = User.find_by(email: params[:user][:email])
      if @user && @user.authenticate(params[:user][:password])
      session[:user_id] = @user.id
      redirect_to root_path
      else
      @error = "Try Again"
      render :new
      end

    else
      @user = User.find_or_create_by(uid: auth['uid']) do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "pedro.acosta63@gmail.com"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1386709828023956"]]