app/controllers/welcome_controller.rb

SELECT "lists".* FROM "lists"
---
  def home
    @lists = List.all